# Path Reinforcement Alternating Bar Shape Id Property

Source: https://www.revitapidocs.com/2026/192a6b79-2b79-b4f3-a084-8dd0940d9e42.htm

---

| Path Reinforcement Alternating Bar Shape Id Property |
| --- |

The RebarShape element that defines the shape of the alternating bars of the Path Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId AlternatingBarShapeId { get; set; }
```

```
Public Property AlternatingBarShapeId As ElementId
	Get
	Set
```

```
public:
property ElementId^ AlternatingBarShapeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member AlternatingBarShapeId : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: shapeId should refer to two dimensional Rebar Shape element with segments forming only right angles,  or the Rebar Shape has at least one end treatment or it has at least one crank. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |
| InvalidOperationException | When setting this property: This Path Reinforcement does not have alternating bars enabled.  \-or\-  When setting this property: This PathReinforcement does not host Rebar. |

Remarks Changing the value of this property causes the Path Reinforcement to choose values for its
 shape parameters.
 Before calling this method, alternating bars have to be enabled in the Path Reinforcement by setting PATH\_REIN\_ALTERNATING BuiltInParameter. See Also

#### Reference

PathReinforcement Class Autodesk.Revit.DB.Structure Namespace